export interface HistoryEvent {
  year: string;
  event: string;
}

export const historyData: HistoryEvent[] = [
  { year: "昭和3年", event: "橋爪由也が大船渡に金物船具商を開業。" },
  { year: "12年", event: "東北セメント大船渡工場のセメント販売特約店となる。" },
  {
    year: "17年",
    event:
      "同工場と小野田セメント社の合併後も引き続き特約店となり、セメント及び石灰運搬のため海運業を兼営。",
  },
  {
    year: "26年5月",
    event:
      "法人に改組し、社長橋爪由也、橋爪商事株式会社（資本金100万円）を設立。",
  },
  {
    year: "42年3月",
    event: "海運業を廃業し、7月4回の増資を経て資本金1,200万円となる。",
  },
  { year: "43年", event: "大船渡レミコン工場を建設、生コン製造販売を開始。" },
  {
    year: "45年",
    event:
      "高田営業所、高田レミコン工場開設、社長橋爪由也死去に伴い橋爪幸平社長に就任。",
  },
  { year: "46年", event: "現在地に本社を移転し、又北上営業所を開設。" },
  { year: "47年", event: "保険部門別会社に組織替" },
  {
    year: "48年",
    event:
      "北上支店新築移転し、六原スプリットン工場建設及び盛岡営業所を開設し、資本金2,000万円となる。",
  },
  { year: "49年", event: "仙台営業所を開設。" },
  { year: "50年", event: "資本金2,600万円となる。" },
  {
    year: "53年",
    event:
      "大船渡レミコン工場を新替し、大船渡レミコン第２工場を高田工場に移転。又、資本金5,200万円となる。",
  },
  {
    year: "54年",
    event:
      "高田レミコン工場売却、高田支店事務所倉庫新築移転、資本金9,800万円となる。",
  },
  { year: "55年", event: "盛岡支店事務所倉庫新築移転。" },
  { year: "56年", event: "三戸支店、志津川支店、田沢湖営業所を開設。" },
  { year: "57年", event: "宮古支店を開設、資本金１億2,740万円となる。" },
  {
    year: "58年",
    event: "一関、久慈営業所を開設し、大船渡レミコンを分離独立。",
  },
  {
    year: "62年8月",
    event:
      "大曲営業所を開設。10月、大船渡レミコン、川井レミコンを統合、大船渡レミコン大船渡工場、川井工場とする。",
  },
  { year: "63年4月", event: "仙台営業所を仙台支店に改組。" },
  {
    year: "平成元年1月",
    event: "仙台支店事務所倉庫新築移転、一関営業所事務所倉庫新築移転。",
  },
  { year: "6月", event: "資本金１億5,153万円とした。" },
  { year: "12月", event: "大曲営業所を大曲支店とし、事務所・倉庫新築移転。" },
  { year: "2年6月", event: "資本金２億1,700万円となる。" },
  { year: "8月", event: "本荘営業所開設。" },
  {
    year: "3年5月",
    event: "橋爪幸平会長、宮澤信平社長に就任。資本金２億5,120万円となる。",
  },
  { year: "11月", event: "マーク変更。" },
  {
    year: "7年4月",
    event: "一関営業所を一関支店とし、事務所・倉庫を新築。高田レミコン買収。",
  },
  {
    year: "10年4月",
    event: "本荘営業所を大曲支店へ統合し、高田レミコンを分離独立。",
  },
  { year: "13年3月", event: "大船渡レミコン川井工場閉鎖。" },
  {
    year: "14年4月",
    event:
      "田沢湖営業所を大曲支店へ統合し、久慈営業所を久慈支店に改組、ISO9001:本社認証取得。",
  },
  { year: "18年1月", event: "志津川支店を南三陸支店とする。" },
  { year: "19年2月", event: "奥州営業所を開設。" },
  { year: "6月", event: "釜石営業所を開設。" },
  { year: "21年4月", event: "釜石営業所を釜石支店に改組。" },
  {
    year: "23年3月",
    event:
      "東日本大震災　本社社屋、倉庫、高田支店、南三陸支店全壊、釜石支店被災。",
  },
  { year: "24年10月", event: "高田支店新築移転。" },
  { year: "25年3月", event: "南三陸支店新築移転。" },
  {
    year: "25年5月",
    event:
      "社長交代　橋爪博志が社長、宮澤信平が会長、橋爪幸平が相談役にそれぞれ就任。",
  },
  { year: "25年11月", event: "釜石支店新築移転。" },
  { year: "27年4月", event: "気仙沼営業所開設。" },
  { year: "29年7月", event: "本社･本店並びに建材センター新築移転。" },
  { year: "30年12月", event: "宮古支店岩泉出張所開設。" },
  {
    year: "令和元年5月",
    event:
      "本店 鉄鋼･土木資材センター及び化成品倉庫新築移転。本社・本店が拠点集約。",
  },
  { year: "2年9月", event: "気仙沼営業所移転。" },
  { year: "9月", event: "宮古支店移転。" },
  { year: "3年11月", event: "遠野出張所開設。" },
];
