export const services = [
  {
    icon: "📈",
    title: "開発営業",
    description:
      "21世紀の日本の産業界は、これまでにない新商品の開発に心血を注いでおります。それに伴い、商品のライフサイクルも著しいものがあります。そうした時代の環境に、我々開発営業部は顧客である官公庁・土木コンサル様に対して新製品のご紹介、そして物件情報をもとに工事計画を把握し、ニーズにお応えする商品選定をして提案営業を積極的に展開しております。",
  },
  {
    icon: "🏗️",
    title: "建材",
    description:
      "私たち建材部のスタップはお客様とメーカーとの中間に位置しながら、常に情報交換を緊密に行える様心がけています。質の高い健康で快適な住宅づくりこそ、私たちが目指し続けているものです",
  },
  {
    icon: "⚙️",
    title: "セメント",
    description:
      "人々が集う処、そこにはいくつものコンクリートがあります。いつも見慣れているそのコンクリートも、形や色はさほどかわらなくとも、その品質や施工技術は時代と共に大きく進歩し続けています。私たちセメント部は、ふるさとの発展を支える礎として、このセメントのぬくもりを影響しつつけます。",
  },
  {
    icon: "🔧",
    title: "鋼材・土木",
    description:
      "環境に対する社会的認識が高まる中、環境配慮に向けた取り組みが要望されています。私たちは顧客満足の実現に向けて、便利で快適な社会を支えるインフラ整備充実のため積極的に迅速可鍛に挑戦しています。",
  },
  {
    icon: "🔩",
    title: "金物",
    description:
      "金物では、上下水道用材・配管材・鋼材二次製品を主軸に、建築・土木工事のあらゆる面で対応できる製品を取りそろえております。技術工法の変化の著しい今日、常に新しい情報をメーカー等とタイアップしながらお客様に提供できる様努力しております。",
  },
  {
    icon: "🧪",
    title: "化成品",
    description:
      "環境問題がクローズアップされる中、コンプライアンスを重視し、無機・有機化学薬品をはじめ、半導体薬品、触媒などの高機能薬品、什器備品を取り扱っております。",
  },
  {
    icon: "💻",
    title: "DX",
    description:
      "デジタルトランスフォーメーションを推進し、業務効率化を図ります.",
  },
];
